# Basic Sales Analysis & Key Performance Indicators (KPIs)-(online_retail)

## Notebook Overview: Sales Analysis & Key Performance Indicators (KPIs)
In this notebook, we explore key metrics to understand customer behavior and overall business performance using transactional sales data. The analysis is performed using SQL queries on a PostgreSQL database, with results visualized and interpreted in Python.

Key Analyses Included:

* Top 10 Customers by Total Spending – Identifies the most valuable customers based on the total revenue they generated.

* Top 10 Best-Selling Products by Quantity – Highlights the products with the highest number of units sold.

* Sales by Country – Aggregates revenue per country to uncover top-performing markets.

* Daily Sales Trend – Visualizes how sales fluctuate over time to detect trends and seasonality.

* Average Order Value per Customer – Calculates the mean value of purchases per customer to estimate buying behavior.

These insights provide a foundational understanding of the business’s revenue drivers and customer dynamics.

###  Data Source & Tools

This analysis was performed using **PostgreSQL** as the database engine, with data loaded and queried directly using **Python (psycopg2 / SQLAlchemy)**. 

The dataset was imported into a PostgreSQL database, where data cleaning and transformation were done using SQL. Python was then used to connect to the database, retrieve data using SQL queries, and perform further analysis and visualization in Jupyter Notebooks.

In [9]:
import pandas as pd 
from sqlalchemy import create_engine , text

engine = create_engine("postgresql://postgres:Zahrehkhar1!@localhost:5432/Online_Retail_DB")

# 1. Top 10 Customers by Total Spending
This query helps identify the most valuable customers based on their total purchase amount.

In [4]:
query = """
SELECT 
    s.customer_id,
    c.country,
    ROUND(SUM(s.quantity * s.unit_price), 2) AS total_spent
FROM fact_sales s
JOIN dim_customer c ON s.customer_id = c.customer_id
GROUP BY s.customer_id, c.country
ORDER BY total_spent DESC
LIMIT 10;
"""

with engine.connect() as conn:
    df_top_customers = pd.read_sql(text(query), conn)

df_top_customers

  customer_id         country  total_spent
0       14646     Netherlands    279489.02
1       18102  United Kingdom    256438.49
2       17450  United Kingdom    188467.83
3       14911            EIRE    132458.73
4       12415       Australia    123725.45
5       14156            EIRE    113038.14
6       17511  United Kingdom     88125.38
7       16684  United Kingdom     65892.08
8       13694  United Kingdom     62690.54
9       15311  United Kingdom     59247.22

# 2. Top 10 Best-Selling Products by Quantity
This shows which products have sold the most units overall.

In [5]:
query = """
SELECT 
    p.stock_code,
    p.description,
    SUM(s.quantity) AS total_units_sold
FROM fact_sales s
JOIN dim_product p ON s.stock_code = p.stock_code
GROUP BY p.stock_code, p.description
ORDER BY total_units_sold DESC
LIMIT 10;
"""

with engine.connect() as conn:
    df_top_products = pd.read_sql(text(query), conn)

df_top_products

  stock_code                         description  total_units_sold
0      84077   WORLD WAR 2 GLIDERS ASSTD DESIGNS             53119
1      22197                SMALL POPCORN HOLDER             48555
2     85099B             JUMBO BAG RED RETROSPOT             44922
3      84879       ASSORTED COLOUR BIRD ORNAMENT             35086
4     85123A                                   ?             34078
5      21212     PACK OF 72 RETROSPOT CAKE CASES             33347
6      23084                     temp adjustment             26998
7      22492             MINI PAINT SET VINTAGE              25880
8      22616          PACK OF 12 LONDON TISSUES              25260
9      21977  PACK OF 60 PINK PAISLEY CAKE CASES             24098

# 3. Sales by Country
This summarizes total sales value per country to detect top markets.

In [6]:
query = """
SELECT 
    c.country,
    ROUND(SUM(s.unit_price * s.quantity), 2) AS total_sales
FROM fact_sales s
JOIN dim_customer c ON s.customer_id = c.customer_id
GROUP BY c.country
ORDER BY total_sales DESC;
"""

with engine.connect() as conn:
    df_country_sales = pd.read_sql(text(query), conn)

df_country_sales

                 country  total_sales
0         United Kingdom   6720547.24
1            Netherlands    284661.54
2                   EIRE    249825.33
3                Germany    221364.80
4                 France    196594.52
5              Australia    138383.31
6            Switzerland     55457.19
7                  Spain     53484.03
8                Belgium     39993.40
9                 Sweden     36585.41
10                 Japan     35340.62
11                Norway     34767.06
12              Portugal     28930.91
13               Finland     22273.94
14       Channel Islands     20076.39
15               Denmark     19442.20
16                 Italy     16890.51
17                Cyprus     13567.02
18               Austria      9439.14
19             Singapore      9120.39
20                Poland      7213.14
21                Israel      6988.40
22                Greece      4710.52
23               Iceland      4310.00
24                Canada      3666.38
25           Unspecified      2656.62
26                 Malta      2505.47
27  United Arab Emirates      1902.28
28                   USA      1730.92
29               Lebanon      1693.88
30             Lithuania      1661.06
31    European Community      1291.75
32                Brazil      1143.60
33                   RSA      1002.31
34        Czech Republic       707.72
35               Bahrain       548.40
36          Saudi Arabia       131.17

# 4. Daily Sales Trend
This shows how total sales have changed over time on a daily basis.

In [7]:
query = """
SELECT 
    s.date,
    ROUND(SUM(s.unit_price * s.quantity), 2) AS daily_sales
FROM fact_sales s
GROUP BY s.date
ORDER BY s.date;
"""

with engine.connect() as conn:
    df_daily_sales = pd.read_sql(text(query), conn)

df_daily_sales.head(10)  # Show sample

         date  daily_sales
0  2010-12-01     45573.28
1  2010-12-02     45595.84
2  2010-12-03     22533.18
3  2010-12-05     30546.25
4  2010-12-06     30061.86
5  2010-12-07     52968.24
6  2010-12-08     37678.79
7  2010-12-09     37052.21
8  2010-12-10     31719.33
9  2010-12-12     16783.40

# 5. Average Order Value per Customer
This calculates the average basket value per customer based on distinct invoices.

In [8]:
query = """
SELECT 
    customer_id,
    ROUND(SUM(quantity * unit_price) / COUNT(DISTINCT invoice_no), 2) AS avg_order_value
FROM fact_sales
GROUP BY customer_id
ORDER BY avg_order_value DESC
LIMIT 10;
"""

with engine.connect() as conn:
    df_avg_order_value = pd.read_sql(text(query), conn)

df_avg_order_value

  customer_id  avg_order_value
0       12357          6207.67
1       15749          5383.98
2       12688          4873.81
3       12415          4758.67
4       12752          4366.78
5       18251          4314.72
6       18102          4136.10
7       16000          4131.23
8       12378          4008.62
9       12435          3914.95

### Conclusion and Business Insights

Based on the key analyses performed on the Online Retail dataset, we derived the following insights:

- **Top 10 Customers by Total Spending:**  
A small group of customers generates the majority of the revenue, highlighting the importance of focusing retention and personalized marketing efforts on these high-value customers.

- **Top 10 Best-Selling Products by Quantity:**  
Sales are concentrated among a few best-selling products, suggesting that optimizing inventory and promotions around these items can drive overall sales growth.

- **Sales by Country:**  
The United Kingdom is the dominant market for sales, but notable revenue from other countries indicates opportunities for international expansion and targeted marketing.

- **Daily Sales Trend:**  
Sales exhibit clear seasonal patterns and fluctuations over time, emphasizing the need for careful demand forecasting and inventory planning to manage peak periods efficiently.

- **Average Order Value per Customer:**  
Understanding the average spending per customer helps to assess purchasing behavior and tailor pricing or promotional strategies to maximize order values.

Together, these insights form a foundational understanding of the business’s revenue drivers and customer behavior, which can guide strategic decisions in marketing, inventory management, and expansion planning.

## Data Source:
This analysis is based on the Online Retail Dataset provided by the UCI Machine Learning Repository. The dataset includes transactional data from a UK-based online retail company from 2010–2011.
Link: https://archive.ics.uci.edu/dataset/352/online+retail